#### DimensionShape Enumeration

---

|  |
| --- |
| See Also |

An enumerated type to list dimension type.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public enum DimensionShape ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration DimensionShape ``` |

| Visual C++ |
| --- |
| ``` public enum class DimensionShape ``` |

# Members

| Member name | Description |
| --- | --- |
| Linear | Linear dimension. |
| Angular | Angular dimension. |
| Radial | Radial dimension. |
| ArcLength | ArcLength dimension. |
| Spot | Spot dimension. |
| Diameter | Diameter dimension. |
| Unknown | Unknown type dimension. |

# See Also

Autodesk.Revit.DB Namespace